#+TITLE: Crypto CTF Challenges
#+AUTHOR: Black1fsh



**** scratch:
#+begin_src python :session a2s :results output raw
  from Crypto.Cipher import AES
  from Crypto.Util.Padding import pad, unpad
  import hashlib

  p = []
  c = []
  d0 = bytearray([0] * 16)
  d1 = bytearray([0] * 16)
  d1[0] = 0x01
  d2 = bytearray([0] * 16)
  d2[0] = 0x02
  dc = bytearray([0] * 16)
  dc[0] = 0x0c

  key = [0x00] * 16
  key = bytearray(key);
  cipher = A2S(key)
  key_expand = cipher._key_matrices
  delta_ins = [d0,d1,d2,dc]
  delta_outs = []
  logs = []
  for di in delta_ins:
      ll = []
      plaintext = [x ^ y for x , y in zip(di,d0)]
      plain_state = bytes2matrix(plaintext)
      ll.append(matrix2bytes(plain_state).hex())
      add_round_key(plain_state, key_expand[0])
      ll.append(matrix2bytes(plain_state).hex())
      for i in range(1, cipher.n_rounds):
          shift_rows(plain_state) # p4: moved shift_rows here to capture the expected state for testing
          ll.append(matrix2bytes(plain_state).hex())
          # sub_bytes(plain_state)
          ll.append(matrix2bytes(plain_state).hex())
          mix_columns(plain_state)
          ll.append(matrix2bytes(plain_state).hex())
          add_round_key(plain_state,key_expand[i])
          ll.append(matrix2bytes(plain_state).hex())

      # sub_bytes(plain_state)
      ll.append(matrix2bytes(plain_state).hex())
      shift_rows(plain_state)
      ll.append(matrix2bytes(plain_state).hex())
      mix_columns(plain_state)  # added mix_columns 
      ll.append(matrix2bytes(plain_state).hex())
      add_round_key(plain_state, key_expand[-1])
      ll.append(matrix2bytes(plain_state).hex())
      logs.append(ll)


  for l in logs[1:]:
      print("|plain |add keys |shift | sbox| mix| add keys  | sbox  | shift | mix  | add keys |")
      print('|' + '|'.join([i for i in logs[0]]) + '|')
      print('|' + '|'.join([i for i in l]) + '|')
      print()
#+end_src

#+RESULTS:
| *        |                                * |                                * |                          xor'ed |                                  |                   |
| plain    | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| add keys | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| shift    | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| sbox     | 00000000000000000000000000000000 | 01000000000000000000000000000000 | 1000000000000000000000000000000 |                                  |                   |
| mix      | 00000000000000000000000000000000 | 02010103000000000000000000000000 | 2010103000000000000000000000000 |                                  |                   |
| add keys | 62636363626363636263636362636363 | 60626260626363636263636362636363 | 2010103000000000000000000000000 |                                 |                   |
| sbox     | 62636363626363636263636362636363 | 60626260626363636263636362636363 | 2010103000000000000000000000000 |                                  |                   |
| shift    | 62636363626363636263636362636363 | 60636363626363606263626362626363 | 2000000000000030000010000010000 | 02010103000000000000000000000000 | inverse shift     |
| mix      | 61626260616262606162626061626260 | 65606066626167666061606162606361 | 4020206030305060103020103020101 | 02000000000000030000010000010000 | invese mixcolumns |
| add keys | fafafaa9989999cafafafaa9989999ca | fef8f8af9b9a9cccfbf9f8a89b9b98cb | 4020206030305060103020103020101 |  4020206030305060103020103020101 | xor'ed            |
#+TBLFM: $4='(hex-xor $3 $2)

| plain    | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| add keys | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| shift    | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| sbox     | 00000000000000000000000000000000 | 02000000000000000000000000000000 | 2000000000000000000000000000000 |
| mix      | 00000000000000000000000000000000 | 04020206000000000000000000000000 | 4020206000000000000000000000000 |
| add keys | 62636363626363636263636362636363 | 66616165626363636263636362636363 | 4020206000000000000000000000000 |
| sbox     | 62636363626363636263636362636363 | 66616165626363636263636362636363 | 4020206000000000000000000000000 |
| shift    | 62636363626363636263636362636363 | 66636363626363656263616362616363 | 4000000000000060000020000020000 |
| mix      | 61626260616262606162626061626260 | 6966666c6764686c6364666267666062 | 804040c06060a0c0206040206040202 |
| add keys | fafafaa9989999cafafafaa9989999ca | f2fefea59e9f93c6f8fcfeab9e9d9bc8 | 804040c06060a0c0206040206040202 |
#+TBLFM: $4='(hex-xor $3 $2)
| plain    | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| add keys | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| shift    | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| sbox     | 00000000000000000000000000000000 | 0c000000000000000000000000000000 | c000000000000000000000000000000  |
| mix      | 00000000000000000000000000000000 | 180c0c14000000000000000000000000 | 180c0c14000000000000000000000000 |
| add keys | 62636363626363636263636362636363 | 7a6f6f77626363636263636362636363 | 180c0c14000000000000000000000000 |
| sbox     | 62636363626363636263636362636363 | 7a6f6f77626363636263636362636363 | 180c0c14000000000000000000000000 |
| shift    | 62636363626363636263636362636363 | 7a6363636263637762636f63626f6363 | 180000000000001400000c00000c0000 |
| mix      | 61626260616262606162626061626260 | 517a7a4875765e486d767a6c757a6e6c | 3018182814143c280c14180c14180c0c |
| add keys | fafafaa9989999cafafafaa9989999ca | cae2e2818c8da5e2f6eee2a58c8195c6 | 3018182814143c280c14180c14180c0c |
#+TBLFM: $4='(hex-xor $3 $2)



#+begin_src python :session a2s
def print_ddt(ddt, max_rows=30, max_cols=30):
      """Print the DDT in a formatted way, limited to specified dimensions."""
      print("\nDifferential Distribution Table (partial):")
      print("   |", end=" ")

      # Print header
      for j in range(max_cols):
          print(f"{j:2X}", end=" ")
      print("\n---+" + "---" * max_cols)

      # Print rows
      for i in range(max_rows):
          print(f"{i:2X} |", end=" ")
          for j in range(max_cols):
              print(f"{ddt[i][j]:2d}", end=" ")
          print()

#+end_src
#+begin_src python :session a2s
  p0 = 0x41
  res = {}
  size = len(s_box)
  ddt = [[0 for _ in range(size)] for _ in range(size)]
  for delta_in in range(size):
        for x in range(size):
            y1 = s_box[x]
            y2 = s_box[x ^ delta_in]
            delta_out = y1 ^ y2
            ddt[delta_in][delta_out] += 1
    print_ddt(ddt, 50, 50)
  flatten = [i for k in ddt for i in k]
  print(flatten.count(256))
#+end_src
#+begin_src emacs-lisp :tangle yes
 (defun hex-xor (a b)
     (interactive
      (list
       (read-string "first hex string: ")
       (read-string "second hex string: ")))
     (message "A= %s B= %s" a b)
     (let*
         ((num_a (string-to-number (format "%s" a) 16))
          (num_b (string-to-number (format "%s" b) 16))
          (result (format "%x" (logxor num_a num_b))))
          (message "a_int = %s b_int = %s result = %s" num_a num_b result)

  result)
 )
#+end_src

